In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("sample.csv")

In [3]:
df

        name   age      state      id
0     Tanaka  22.0   Kanagawa  1021.0
1  Takahashi  21.0        NaN  2152.0
2      Ugawa   NaN     Ohsaka  1432.0
3      Oaeda  35.0  Hiroshima  1104.0
4      Kotoh  59.0     Ohsaka  2413.0
5     Mugawa  32.0   Kanagawa     NaN

In [7]:
# df[カラム名] == "検索ワード"で、ブーリアンの値が返ってくる。
df["name"] == "Takahashi"

0    False
1     True
2    False
3    False
4    False
5    False
Name: name, dtype: bool

In [9]:
# 該当する行だけ取り出そう
df[df["name"] == "Takahashi"]

        name   age state      id
1  Takahashi  21.0   NaN  2152.0

In [10]:
# インデックス番号を取得する
df[df["name"] == "Takahashi"].index

Int64Index([1], dtype='int64')

In [11]:
# 1行で書くと以下の通りになる。
df.loc[df[df["name"] == "Takahashi"].index, 'age'] = 37

In [12]:
df

        name   age      state      id
0     Tanaka  22.0   Kanagawa  1021.0
1  Takahashi  37.0        NaN  2152.0
2      Ugawa   NaN     Ohsaka  1432.0
3      Oaeda  35.0  Hiroshima  1104.0
4      Kotoh  59.0     Ohsaka  2413.0
5     Mugawa  32.0   Kanagawa     NaN